W8D1/RedditClone/app/controllers/application_controller.rb

  def current_user
    User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = ? LIMIT ?  [["session_token", "qYHUaVfWesT9wuOEbjQKMA"], ["LIMIT", 1]]

  def is_moderator?
    moderator = Sub.find_by(user_id: current_user.id)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]