W8D1/RedditClone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "sdf"], ["description", "sd"], ["user_id", 2], ["created_at", "2019-12-02 19:56:21.742988"], ["updated_at", "2019-12-02 19:56:21.742988"]]
---
  def create
    @sub = Sub.new(sub_params)
    @sub.user_id = current_user.id
    if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."user_id" = ? AND "subs"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "subs"."id" = ?  [["title", "I LOVE A04 LIGHTWORK BABY"], ["description", "            sd\r\n      \r\n      "], ["updated_at", "2019-12-02 20:03:58.156446"], ["id", 1]]
---
  def update
    @sub = current_user.subs.find_by(id: params[:id])
    if @sub.update(sub_params)