W11D4/Bench_BnB/app/controllers/application_controller.rb

    def current_user
        return nil if session[:session_token].nil?
        @current_user ||= User.find_by_session_token(session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "3G5wZP0ukTY3SlxBz2KxEA"], ["LIMIT", 1]]