W11D4/Bench_BnB/app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
        @user = User.new(user_params)
        if @user.save