W10D5/Todos/app/controllers/api/todos_controller.rb

    def create
        @todo = Todo.new(todo_params)
        if @todo.save
---
INSERT INTO "todos" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "sdfsdf"], ["body", "fsdfsdfsd"], ["done", true], ["created_at", "2019-12-29 20:49:01.546328"], ["updated_at", "2019-12-29 20:49:01.546328"]]

    def update
        @todo = Todo.find(params[:id])
        if !@todo.nil?
            if @todo.update(todo_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "todos" SET "done" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["done", false], ["updated_at", "2019-12-29 23:41:00.647282"], ["id", 9]]

    def destroy
        @todo = Todo.find(params[:id])
        @todo.destroy
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 1]]